Revit 2027 API
EnergyAnalysisOpening.OpeningId Property
 The unique identifier for the opening.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string OpeningId { get; }
Public ReadOnly Property OpeningId As String
	Get
public:
property String^ OpeningId {
	String^ get ();
}
member OpeningId : string with get
Property Value
String
Remarks
 This identification attribute is composed of the id for the parent surface, the prefix "op" and a sequential number, all separated by "-". A sample value would be "su-1-op-1".
See Also
Reference
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace